# შექმენით სია, რომელსაც შეინახავთ ცვლადში სახელად friends. მაგ სიაში უნდა შეინახოთ მინიმუმ 5 მეგობრის სახელი. პირველ რიგში გამოიტანეთ თქვენი საუკეთესო მეგობრის სახელი ინდექსების დახმარებით. დაბეჭდეთ სია. შეცვლაეთ მე-3 ინდექსზე მყოფი სახელი ახალით და დაბეჭდეთ სია. საბოლოოდ დაბეჭდეთ მთლიანი სიის სიგრძე
friends = ["luka","nika","lasha","ani","levani"]
friends[1]
print(friends)
friends [3] = "frank" 
print(friends)
friends.append("luka")
# friends.pop(2)

# 2) შექმენით მანქანების სია, სადაც გამოიყენებთ ერთ-ერთ ფუნქციას, რომ სიაში დაამატოთ ახალი მანქანა.
cars = ["bmw","mercedes","ferrari"]
print(cars)
cars.append("opeli")
print(cars)

# 3)შექმენით რიცხვების სია სადაც გექნებათ მინიმუმ ხუთი რიცხვი. შეცვლაეთ ამ სიის პირველი ელემენტი და გაუტოლეთ ის 50-ს. შემდეგ კი გამოიტანეთ სიიდან პირველი და ბოლო რიცხვის ჯამი
numbers = [0,1,2,3,4,5]
numbers[0] = 50
print((numbers[0] + numbers[5]))