const { gerenateSuperhero } = require("./node_modules/superheros/index");

gerenateSuperhero();

// npm ნიშნავს "Node Package Manager"-ს.
// ის არის პაკეტების მენეჯერი Node.js-ისთვის, რომელიც საშუალებას გვაძლევს,
// მარტივად დავაყენოთ, განვაახლოთ ან წავშალოთ სხვადასხვა ბიბლიოთეკები ან მოდულები.
// მაგალითად, როდესაც გვჭირდება კონკრეტული ბიბლიოთეკა პროექტში


// SERVER (სერვერი)
// სერვერი არის კომპიუტერი ან პროგრამა, რომელიც უზრუნველყოფს სერვისს სხვა კომპიუტერებისთვის,
// რომლებსაც ეწოდებათ კლიენტები. მაგალითად, როდესაც ვხსნით ვებსაიტს,
// ჩვენი ბრაუზერი (კლიენტი) აკეთებს მოთხოვნას სერვერზე და სერვერი აგზავნის პასუხს — HTML გვერდს.

// DNS (Domain Name System)
// DNS არის სისტემა, რომელიც გარდაქმნის დომენის სახელებს (მაგალითად: google.com)
// IP მისამართებად (მაგალითად: 142.250.190.78), რათა კომპიუტერებმა ერთმანეთთან კომუნიკაცია შეძლონ.

// HTTP (Hypertext Transfer Protocol)
// HTTP არის პროტოკოლი, ანუ წესების ნაკრები, რომელიც განსაზღვრავს,
// როგორ უნდა მოხდეს ინფორმაციის გადაცემა ვებბრაუზერსა და სერვერს შორის.
// როდესაც ვხსნით ვებსაიტს, ბრაუზერი აგზავნის HTTP მოთხოვნას,
// ხოლო სერვერი აბრუნებს HTTP პასუხს, რომელიც შეიცავს საჭირო მონაცემებს — მაგალითად HTML ფაილს.
