// ფუნქია არის კოდის ბლოკი რომელიც ასრულებს რაღაც კონკრერტულ დავალებას და მისი გამოძახებაა იმდენჯერაა შესაძლებელი რამდენჯერაც ამას მოვიდნომებთ

function greet(userName) {
  return `hello ${userName}`;
}
console.log(greet("saba"));
// მე ამ ფუნქციას გამოვიყენებ იმდეჯერ რამდენჯერაც მომინდება და გადავცემ სხვადსხვა პარამტერს

// არსებობს სამი სახის გზა რომ შევქმათ ფუნქცია
// 1. არის ფუნქციის დეკლარაცია რომელსაც უბრალოდ გადვცემთ ფუნქციის სახელს და პარამეტრს და ვხსნით {} სადაც ჩავწერთ პირობას მაგალითად

function greet(userName) {
  return `hello ${userName}`;
}
console.log(greet("saba"));

// მე აქ ფუნქციას დავრქვი greet და პარამეტრად ანუ გადასაცემ მნიშველობად გადავეცი userName შემდეგ გავწერე პირობა {} შემდეგ რაც მინდა რომ გააკეთოს ჩემმა ფუნქციამ

// 2. გზა რომ შექმნა ცვლადი არის ისრის იგივე => ფუნქცია რომელის დამხრებითად შეგვიძლია შევამოკლოთ კოდი და ამასთან ერთად უფრო გასაგები იყოს ის ავიღოთ ისევ greet ფუნქციის მაგალითი

const greet = (userName) => {
  return `hello ${userName}!`;
};
console.log(greet("luka"));

// ეს არის ბევრად უფრო დახვეწწილი და გასაგები ფორმა ფუნქციის დაწერის თუ დავაკვირდებით ვნახავთ რომ აღარ ვიყენებთ სიტყვას სახელად function ამის მაგივრად ვქმნით ცვლადს სახელად greet და სწორედ ამ greet - ს ვაძლევთ გადასაცემ მნიშვნელობას userName შემდეგ ვხსნით კლაკნილ ფრჩხილებს და ვწერთ პირობას თუ რა მინდა გააკეთოს ამ ფუნქციამ

// 3. შექმნის გზა არის annonimus ფუნქცია რომელსაც არ ჭირდება არანაირი მეტობის ნიშნანი ის შეგვიძლია გადავცეთ ცვლადს მაგალითად ავიღოთ ისევ greet ფუნქცია

const greet = function (userName) {
  return `hello ${userName}`;
};
// როგორც ვცდეავთ მე შშევქმენი ცვლადი სახელად greet და და შემდეგ დავიწყე მისი დეკლარაცია მაგრამ ამჯერად სახელის მითითება არ მიწევს function ის შემდეგ რადგან მე ის ცვლადს გადავეცი ანუ როგორც კი მე ამ ცვლადს გამოვიყენებ და გადავცემ სახელს პარამეტრად ავოტმატურად გამომიტანს შედეგს


// scope მარტივად რომ ვთქვათ გვაჩვენებს (განსაზღვრავს) თუ სად არის ხელმისაწვდომი ჩემი შექმნილი ცვლადი არსებობს სამი ტიპის scope
// 1. ეს არის global scope რომლებიც ხელმისაწვდომია ყველგან 

let globaVariable = "saba";
function random() {
  console.log(globaVariable);
}
