#  მომხარებელს შემოატანინეთ ორი რიცხვი, აიყვანეთ ისინი მე-3 ხარისხში და გაიგეთ მათი ჯამი, თუ ჯამი ლუწია დაპრინტეთ "Result is Even", სხვა შემთვევაში "Result is Odd"

# ეკითხება მომხმარებელს ციფრებს
num1 =int(input("Enter your number: "))
num2 =int(input("Enter your number: "))
# აყავს კუბში
cube = num1**3 + num2**3
# თუ მომხმარებლის ციპრების კუბში აყვანისას მათი ჯამი გაიყო 2 ზე და ნაშთი გვაქ 0 პრინტავს Result is Even
if cube % 2 == 0:
    print("Result is Even")
    # თუ მომხმარებლის ციპრების კუბში აყვანისას მათი ჯამი გაიყო 2 ზე და ნაშთში გვაქ 1(ანუ ლუწი რიცხვი) პრინტავს Result is Even
else:
    print("Result is Odd")  