const cars = ["bmw", "mercedes", "volkswagen", "ferrari"];
const me = {
    firstname: "saba",
    lastname: "Tabatadze",
    age: 19,
};
console.table(cars);
console.table(me);

// მოდული არის ფაილი, რომელიც შეიცავს კოდს მაგალითად ფუნქციებს ან ცვალდებს
// ჩაშენებული მოდულები არის ისეთი მოდულები რომლებსაც არ სჭირდება გადმოწერა და ქარხნულად მოყვება პროგრამულ ენას
// გარე მოდულები არის მოდულები რომლებიც ჩვენი ხელით უნდა დავაინსტალიროთ
// გამშვები გარემო არის პროგრამა რომელიც პროგრამულ ენას საშუალებას აძლევს იმუშაოს კომპიურერში და არა ბრაუზერში
// გლობალური მოდული არის ისეთი მოდული რომელიც მთელ სისტემაში არის დაინსტალურებული
